<template>
  <div class="service">
    <v-header :data="headData" @leftIconClick="back"></v-header>
    <div class="main">
      <div class="m-list">
        <ul>
          <li :class="{active:idx === currentIdx}"
              v-for="(item,idx) in list">
            <div class="tit" @click="selectItem(item,idx)">
              <p>
                <i v-if="item.icon" class="icon-badge-shit" :class="getIcon(item)"></i>
                <span>{{item.text}}</span>
              </p>
              <i class="iconfont icon-arrow"></i>
            </div>
            <transition name="slide-fade">
              <div v-if="idx === currentIdx && item.content" class="sub">
                <div v-html="item.content.text"></div>
              </div>
            </transition>

          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
  import {commonHead} from '@/common/js/mixin'

  export default {
    mixins: [commonHead],
    data() {
      return {
        headData: {
            title: '优惠问题',
            leftIcon: 'arrowr',
            rightIcon: '',
        },
        list: [
          {
            text: '优惠',
            content: {
              text:`
                  <span>如何查看官网优惠？</span>
                  <p>
                      您好，您可以到我们官网优惠页面查看现在有哪些优惠，另外特殊活动部份会在官网公告通知，您可以多多留意一下。
                  </p>
              `
            },
          },
          {
            text: '体验金',
            content: {
              text: `
                      <ul>
			   		<li>
			   			<span>如何领取体验金？</span>
			   			<p>
							开户体验金需要您下载我们的手机APP才可以领取<br/>
							1.注册账号后，请您先下载我们的手机APP<br />
							2.进入”我—账户设置—绑定银行卡“内，先绑定银行卡或者登陆网页版进入“个人中心——账户设置——银行卡管理”内绑定银行卡呢。<br />
							3.登入APP进入"我的->APP彩金"内自助领取即可。<br />
							4.如果有重复信息,系统都是会有提示的,像同电脑,同IP,同姓名,同地址,同邮箱,同手机号注册等,都是不可以申请的。<br />
							提醒您：如果有重复信息，系统都是会有提示的，像同电脑，同ip，同姓名，同地址，同邮箱，同手机号注册等，都是不可以申请体验金的！
			   			</p>
			   		</li>
			   		<li>
			   			<span>为什么我无法申请体验金？？</span>
			   			<p>
							您好，若您无法申请体验金，请您提供您的账号，以及您无法申请的错误提示给在线客服，让在线客服为您查询处理。
			   			</p>
			   		</li>
			   		<li>
			   			<span>体验金可以取款吗？有上限吗？</span>
			   			<p>
							您好,体验金最低取款金额是388最高提款金额是688,如有超过额度的部份需要进行扣除。
			   			</p>
			   		</li>
			   		<li>
			   			<span>体验金是送多少金额？？</span>
			   			<p>
							您好,尊宝体验金是12-88元 , 由系统随机派发的
			   			</p>
			   		</li>
			   		<li>
			   			<span>怎麽不能绑银行卡？</span>
			   			<p>
							您好，请您先到帐户设置>提款卡折号绑定，先绑定提款卡后再进行体验金的申请，提醒您第三步骤请选择您绑定的银行卡别后直接点击下一步即可。
			   			</p>
			   		</li>
			   		<li>
			   			<span>怎麽提示我信息重复呢?？</span>
			   			<p>
							您好，如您的真实姓名、手机号、邮箱、最后登录IP、注册ip、提款卡等，有一个资料跟其他玩家重复都不能使用自助体验金的! 很抱歉，还请您参考其他优惠
			   			</p>
			   		</li>
			   		<li>
			   			<span>银行卡重复是什麽意思?？</span>
			   			<p>
							您好，重复银行卡是您的银行卡有其他的游戏账号重复进行绑定，所以无法申请体验金的，还请您参考其他优惠噢
			   			</p>
			   		</li>
			   		<li>
			   			<span>为什么验证短信没有收到？</span>
			   			<p>
							您好，必须要使用注册手机号码才能申请。<br />
							短信验证码收不到有以下四种情况：<br />
							一、请确认您的电话有无设置拦截功能，<br />
							二、请确认您的短信有无被运营商屏蔽，<br />
							三、虚拟手机号码或者虚拟运营商暂时收不到短信，<br />
							四、手机信号不稳定或者网络延迟也会造成收不到短信。<br />
							若您确认没有以上问题，还是无法收到，建议您参考其他官网优惠。
			   			</p>
			   		</li>
			   	</ul>
              `
            },
          },
          {
            text: '自助返水',
            content: {
              text: `
              <ul>
			   		<li>
			   			<span>自助返水的最低申请金额是多少？？</span>
			   			<p>
							您好，网站自助返水的最低申请金额是1元。
			   			</p>
			   		</li>
			   		<li>
			   			<span>我今天忘记申请自助返水了？我的返水还在吗？</span>
			   			<p>
							您好，自助返水每个平台结算的是有效投注额，未自助申请的返水将于第2天系统进行结算派发，系统结算的返水为昨日00:00:00到23:59:59未自助领取的的返水。
			   			</p>
			   		</li>
			   		<li>
			   			<span>自助返水提示，上一笔自助洗码审核中，怎么办？</span>
			   			<p>
							您好，出现此提示，请您联系在线客服，提供您的游戏账号，自助返水申请平台，在线客服会协助您处理。
			   			</p>
			   		</li>
			   		<li>
			   			<span>为什么我娱乐PT平台好久了，自助返水数据还一直不更新？？</span>
			   			<p>
							您好，若您游戏的是PT累积类的游戏，是无法申请自助返水的，返水会在次日以系统返水的形式派发给您；若您娱乐的是老虎机类型的游戏返水数据却一直未更新，请您联系在线客服为您查询处理。
			   			</p>
			   		</li>
			   		<li>
			   			<span>自助返水有申请的时间限制吗？？</span>
			   			<p>
							您好，每天的00：00—03：00为系统结算时间，暂不能使用自助返水(老虎机账户除外)
			   			</p>
			   		</li>
			   		<li>
			   			<span>自助返水有申请的次数限制吗？</span>
			   			<p>
							您好，自助返水无次数限制，自助返水申请提交后，返水金额会自动添加到您的尊宝账号中。
			   			</p>
			   		</li>
			   	</ul>
              `
            },
          },
          {
            text: '自助救援金',
            content: {
              text: `
              	<ul>
			   		<li>
			   			<span>怎么申请救援金？？</span>
			   			<p>
							您好,救援金是不需要申请的,<br>
							单日在尊宝存款100所有老虎机平台总和负盈利50以上,<br>
							在次日08:00以前系统自动结算到救援金,<br>
							您可以自助选择领取(尊宝APP我的->自助优惠->自助救援金),达到10倍流水即可提款,<br>
							提醒您~救援金有效时间为60天,时间内未领取会自动取消。
			   			</p>
			   		</li>
			   		<li>
			   			<span>救援金的比例是怎么计算的？</span>
			   			<p>
							您好，网站的救援金比例是按照玩家的会员等级划分的，详情您可以点击官网最新优惠，强力救援金优惠进行查看。
			   			</p>
			   		</li>
			   		<li>
			   			<span>救援金的负盈利是怎么计算的？</span>
			   			<p>
							您好，网站的救援金负盈利计算：<br />
							1.首先当日的老虎机平台输赢值计算方式是这样的，您的总投注扣掉游戏局数当中赢与输的相抵扣。<br />
							2.计算出来的输赢值 － 当日领取红利(如返水，幸运抽奖，存送优惠等等)＝负盈利<br />
							3.当日存款满100元，而负盈利大于50就有资格领取救援金了~
			   			</p>
			   		</li>
			   	</ul>
              `
            },
          },

            {
                text: '申请存送优惠',
                content: {
                    text: `
                    <ul>
                      <li>
                          <span>怎么申请存送优惠？？</span>
                          <p>
                              优惠申请无需联系在线客服，网页版的用户请点击：个人中心—优惠领取—存送优惠—选择您要申请的存送申请即可； 手机APP版的用户请点击：我—自助优惠—自助存送—选择您要申请的存送申请即可。
                          </p>
                      </li>
                      <li>
                          <span>你们网站的存款优惠的流水是怎么计算的？？</span>
                          <p>
                              存送优惠的流水计算公式是：（本金+优惠）*流水倍数
                          </p>
                      </li>
                  </ul>
              `
                },
            },
            {
                text: 'VIP自助礼金',
                content: {
                    text: `
                    <ul>
                        <li>
                            <span>免费筹码怎麽领取？？</span>
                            <p>
                                您好，此为举人老爷以上的玩家才享有，可以进入个人中心--优惠领取--VIP免费礼金自助操作领取。
                            </p>
                        </li>
                        <li>
                            <span>存款回馈怎麽领取？？</span>
                            <p>
                                您好，此为六品知州以上的玩家才享有，可以进入个人中心--优惠领取--VIP存款回馈自助操作领取。
                            </p>
                        </li>
                    </ul>
              `
                },
            },
            {
                text: '优惠劵',
                content: {
                    text: `
              	<ul>
			   		<li>
			   			<span>怎么申请使用红包优惠券？？</span>
			   			<p>
							您好，红包优惠券的使用方式：个人中心>自助优惠>优惠券专区>红包优惠券，输入代码，选择游戏平台提交即可，感谢您对我们的支持！
			   			</p>
			   		</li>
			   		<li>
			   			<span>怎么申请使用存送优惠券？？</span>
			   			<p>
							您好，存送优惠券使用方式：存款100以上后，进入个人中心>自助优惠>优惠券专区>选择存送优惠券，填上存款金额及优惠券代码，优惠彩金会直接派到您选择平台的帐户，优惠券有限期限是30天，请在时间内进行使用，避免权益损失，谢谢。
			   			</p>
			   		</li>
			   	</ul>
              `
                },
            },
            {
                text: '签到',
                content: {
                    text: `
              	<ul>
			   		<li>
			   			<span>如何使用签到彩金?</span>
			   			<p>
							您好,依照您的等级达到当月指定存款金额,即可领取使用签到彩金,最低转入平台金额是10元以上,提款需要达到奖金的10倍流水。
			   			</p>
			   		</li>
			   	</ul>
              `
                },
            },
            {
                text: '晋级',
                content: {
                    text: `
              	<ul>
			   		<li>
			   			<span>为什么我自助晋级的时候提示系统繁忙？？</span>
			   			<p>
							您好，每个玩家每个月只能自助晋级一次，若您本月已经自助晋级过了，再次晋级的时候会提示您【系统繁忙】
			   			</p>
			   		</li>
			   	</ul>
              `
                },
            },
            {
                text: '生日礼金',
                content: {
                    text: `
              		<ul>
			   		<li>
			   			<span>如何申请生日礼金？</span>
			   			<p>
							您好，申请生日礼金需要达到秀才及以上会员，且在注册填写生日前后三天在【个人中心】→【优惠领取】→【生日礼金】进行自助领取。
			   			</p>
			   		</li>
			   		<li>
			   			<span>注册生日填写错了，可以按照实际的生日领取生日礼金吗？</span>
			   			<p>
							您好，网站的生日礼金是以玩家注册时填写的为准，并且每年只能领取一次。
			   			</p>
			   		</li>
			   		<li>
			   			<span>生日礼金领取有什么要求？</span>
			   			<p>
							您好，网站的生日礼金是秀才及第以上的玩家才享有，并且要求在注册生日的前后三天内自行领取，若未在开放时间内自助领取则视同放弃，不予补派发。
			   			</p>
			   		</li>
			   	</ul>
              `
                },
            },
        ],
        currentIdx: -1
      }
    },
    computed: {
    },
    created() {
    },
    methods: {
      selectItem(item, idx) {
        if (this.currentIdx === idx) {
          this.currentIdx = -1
          return
        }
        this.currentIdx = idx
      },
      getIcon(item) {
        return `iconfont icon-${item.icon}`
      },
    },
    watch: {},
    components: {}

  }
</script>

<style lang="stylus" src="./self-item.styl" scoped>

</style>