<template>
  <div class="service">
    <v-header :data="headData" @leftIconClick="back" @rightIconClick="openService"></v-header>
    <div class="main">
      <div class="m-list">
        <ul>
          <li :class="{active:idx === currentIdx}"
              v-for="(item,idx) in list">
            <div class="tit" @click="selectItem(item,idx)">
              <p>
                <i v-if="item.icon" class="icon-badge-shit" :class="getIcon(item)"></i>
                <span>{{item.text}}</span>
              </p>
              <i class="iconfont icon-arrow"></i>
            </div>
            <transition name="slide-fade">
              <div v-if="idx === currentIdx && item.content" class="sub">
                <div v-html="item.content.text"></div>
              </div>
            </transition>

          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
  import {commonHead} from '@/common/js/mixin'

  export default {
    mixins: [commonHead],
    data() {
      return {
        list: [
          {
            icon: 'shouye',
            text: '尊宝简介',
            content: {
              text:`
                <h3>◆ 尊宝简介 ◆</h3>
                <p>
                  Zb11.com尊宝国际隶属于—PIONEER SOLUTIONS TECHNOLOGY DEVELOPMENT LIMITED。注册于菲律宾，zb11.com并持有菲律宾PAGCOR合法博彩牌照。随着现时科技水平不断地创新，亚洲顶级娱乐旗舰zb11.com尊宝国际也持续以领跑者的姿态在真人娱乐城，老虎机，方面推动整个博彩行业的变革及创新。我们的使命是作为行业领袖，致力打造亚洲最有影响力的品牌，为您提供最高品质的客户服务，最友善的使用界面，最创新的产品，最享受的游戏体验，最无忧的账户安全保障，以及最可靠的游戏环境。
                </p>
                <h3>◆ 优势 ◆</h3>
                <p>
                  Zb11.com多渠道的存款方式，业界最快的提款速度，采用256位SSL国际标准加密技术及专业的客服团队7*24为您服务。我们秉承客户至上的理念，为您提供安全，便捷，放心的优质服务。

                  <br>1，秒存，秒提，技术团队独立研发，业界首创。

                  <br>2，zb11.com日结佣金，世界首创。

                  <br>3，多产品，大平台，让客户玩的更尽兴。

                  <br>4，在市场上面享有优质的公信力，不容置疑。

                  <br>5，详细的分析报表功能，让您钱途无量，事事顺利。

                  <br>6，支持多种支付方式，微信，支付宝，等等让您无需束缚。

                </p>
              `
            },
          },
          {
            icon: 'declare',
            text: '用户协议',
            content: {
              text: `1.用户注册《尊宝》游戏帐户，表示用户已确实详阅、理解并同意《尊宝》各项使用规范、游戏规则、各项条款且同意自行承担相应的法律责任；如若不同意《尊宝》任一项协议、条款、规范的内容，用户应立即停止使用尊宝提供的各项服务。

                    <br>2.享用《尊宝》提供的服务是用户本人意愿，参与《尊宝》服务的同时，均视为用户理解和接受输赢风险且其风险由用户自行承担，用户认同《尊宝》所提供的服务是正常、合理、公正、公平的。

                    <br>3.用户声明并承诺，用户在注册开户时所提供的资料，包括用户姓名、电邮地址、电话号码、IP地址，均真实、准确、完整，一但注册，除特殊原因将无法更改。

                    <br>4.用户注册的游戏账户姓名必须与用户身份证、银行账户一致，若不一致，恕《尊宝》无法提供部份服务。

                    <br>5.若发现用户以任何不正当的方式登入或参与任何游戏，《尊宝》有权拒绝服务该用户，并在不通知的情况下冻结或关闭相关游戏账号，不退还任何款项。

                    <br>6.为避免任何争议，各用户参与《尊宝》所有游戏过程中或在结束游戏前，务必检查游戏帐户资料，如发现任何异常情况，应立即与客服联系查证，否则视为同意并接受：其帐户之一切数据或历史数据，以《尊宝》资料库的资料为准，用户不得异议。

                    <br>7.用户拥有超过一个游戏账号，包括同姓名、同一邮件地址、同一家庭、同一住址、同一借记卡/信用卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被将视为联合游戏帐号或可疑游戏账号，本网站有权在不通知的情况下冻结或关闭相关游戏账号，并不退还任何款项。

                    <br>8.所有账户若出现资金有误，用户有义务及时通知本网站调整，且不可使用相关错误金额，任何情况下，相关错误金额被视为无效金额，若用户使用该笔金额进行投注，所有投注被视为无效，一律取消并返还於本网站。

                    <br>9.禁止职业算几率，采用首存及其他优惠等进行不正当下注，若经发现本网站有权在不通知的情况下冻结或关闭相关游戏账户，并不退还款项。

                    <br>10.如果用户电脑配件的结果与《尊宝》服务器赛果不一致，以平台服务器所显示的结果将为最终赛果。用户也认同参与《尊宝》服务的游戏规则，投注状况《尊宝》拥有最终解释权。

                    <br>11.严禁用户用非真实IP地址登录游戏（vpn、远程主机等）。

                    <br>12.用户如有违反本服务条款，《尊宝》有权随时依据相关规则暂停或中止用户使用各项服务。

                    <br>13.用户需认同本协议部分或全部内容是临时性的尊宝娱乐保留随时更改公司服务与各项条款之权力，有权添加、修正或修改各项协议，原因包括但不限于商业原因、遵守监管机构的法律法规、指示、指导或建议或客户服务原因。这些信息仅供参考，在用户与本司之间并不构成协议，合同，和担保的依据，最新的规则与条款可通过网站下方用户协议链接查阅。无论任何情况，尊宝娱乐城拥有最终决定权。

                    <br>14.所有彩票玩法投注不得超过该玩法投注总额的70%的选项。`
            },
          },
          {
            icon: 'zuzhizeren',
            text: '存款条例',
            content: {
              text: `
                1.通过网银自助存款方式的会员，如果忘记填写附言，请及时联系在线客服。特别说明如果出现存款人姓名与游戏账户姓名不一致的情况，请配合提供网银电子回单，以便财务人员进行补单。

                <br>2.通过第三方支付进行存款的会员，如果出现掉单的情况，请及时联系在线客服，并提供订单号，存款金额，存款时间，以便我们尽快为您补单。
              `
            },
          },
          {
            icon: 'yonghuxieyi',
            text: '提款条例',
            content: {
              text: `
                1.用户每日提款次数不限。用户每日最高派彩金额1000万人民币，即所有玩法总和的派彩金额。

                <br>2.最低提款额度为100元，当日提款总额度无上限。

                <br>3.用户申请提款若遇到配合平台抽查，需全力配合，此不在《尊宝》秒提、五分钟提款的承诺范围，平台抽查完毕，若无问题，《尊宝》会于第一时间为用户出款。

                <br>4.所有提款申请必须符合本网站的提款政策，如存款未达到全额投注，即无法通过提款审核，提款申请将会被驳回。若有需要，用户必须提供个人资料如身份证副本、驾驶执照副本、银行交易记录截图、居民户口簿副本等资料。

                <br>5.用户被严禁使用他人或第三者银行账户或银行卡进行取款业务。

                <br>6.《尊宝》秒提、五分钟提款的承诺不包含系统异常、银行维护、网路延迟。

                <br>7.任何会员在老虎机游戏幸运中奖池奖金50000以上，将扣除20%~40%的费用做为平台建设。

                <br>无论任何情况，《尊宝》拥有最终决定权。
              `
            },
          },
          {
            icon: 'qingdan',
            text: '优惠条例',
            content: {
              text: `1.若要享有《尊宝》优惠红利或回赠，用户必须符合活动相关规则及所有条例、附加条款。

                      <br>2.用户涉及个人或团体以不正当的手法，进行骗取或诈骗相关优惠奖金，《尊宝》有权在不通知的情况下冻结或关闭相关账户，并不退还款项，用户将会被列入黑名单，并保留追究权利。

                      <br>3.用户拥有超过一个账户，包括同一姓名、同一邮件地址、同一住址、同一借记卡/信用卡、同一银行账户、同一电脑（大学，团体，网吧，图书馆，办公室等），被视为联合账户或可疑账户。

                      <br>4.一但发现该用户有无风险投注，在尊宝娱乐城除老虎机游戏以外的游戏有对赌行为，《尊宝》有权在不通知的情况下冻结或关闭相关账户，并不退还款项，用户将会被列入黑名单，并保留追究权利。

                      <br>5.《尊宝》有权根据会员情况调整会员投注限额。

                      <br>6.《尊宝》拥有对所有优惠活动在无通知的情况下修改及最终解释的权力。

                      <br>7.无论任何情况，尊宝娱乐城拥有最终决定权。`
            },
          },
        ],
        currentIdx: -1
      }
    },
    computed: {
    },
    created() {
    },
    methods: {
      selectItem(item, idx) {
        if (this.currentIdx === idx) {
          this.currentIdx = -1
          return
        }
        this.currentIdx = idx
      },
      getIcon(item) {
        return `iconfont icon-${item.icon}`
      },
    },
    watch: {},
    components: {}

  }
</script>

<style lang="stylus" src="./about-us.styl" scoped>

</style>